# Імпортуємо бібліотеку tkinter
from tkinter import *


# Створюємо функцію для кнопки
#   label_1["text"] ­- змінює значення атрибута "text" для текстового поля
#   entry_1.get() - отримує дані із поля для введення
#   float() - перетворює текст у дробове число
def btn_click():
    label_1["text"] = f"Периметр квадрату дорівнює {4 * float(entry_1.get())} см."


# Створюємо головне вікно
root = Tk()

# Додаємо заголовок вікна
root.title("Головне вікно")

# Вказуємо розмір вікна ("Ширина х Висота")
root.geometry("600x300")

# Вказуємо чи можна змінювати розміри вікна (X, Y)
root.resizable(False, True)


# Створюємо поле для введення даних
# (вікно, в якому розміщуємо текст;
#  стиль шрифту, розмір шрифту)
entry_1 = Entry(root, font="Arial 20 normal", width=15)

# Створюємо текстове поле
# (вікно, в якому розміщуємо текст;
#  текст;
#  стиль шрифту, розмір шрифту)
label_1 = Label(root, text="Результат", font="Arial 16 bold", fg="tomato")

# Створюємо кнопку
# (вікно, в якому розміщуємо кнопку;
#  текст на кнопці;
#  стиль шрифту, розмір шрифту;
#  функція, яка буде виконуватися при натиснені на кнопку)
button_1 = Button(root, text="Порахувати", font="Arial 16 italic", fg="blue", command=btn_click)


# Розміщуємо елементи у вікні
entry_1.place(x=50, y=20)
button_1.place(x=300, y=20)
label_1.place(x=50, y=100)

# Очікуємо ручного закриття програми
root.mainloop()
