# exit() - завершення програми

print("\n\nОбчислення площі та периметра прямокутника\n\n")

a = float(input("Введіть сторону А: "))
b = float(input("Введіть сторону В: "))

if a > 0 and b > 0:
    s = a * b
    p = 2 * (a + b)

    print("\n\nРЕЗУЛЬТАТ:\n")

    print(f"Площа прямокутника зі сторонами {a} та {b} дорівнює {s} од²")
    print(f"Периметр прямокутника зі сторонами {a} та {b} дорівнює {p} од")
else:
    print("Сторони прямокутника повинні бути більшими за нуль!")
    exit()

# # Альтернативний варіант програми з використанням оператора if
#
# if a <= 0 or b <= 0:
#     print("Сторони прямокутника повинні бути більшими за нуль!")
# else:
#     s = a * b
#     p = 2 * (a + b)
#
#     print("\n\nРЕЗУЛЬТАТ:\n")
#
#     print(f"Площа прямокутника зі сторонами {a} та {b} дорівнює {s} од²")
#     print(f"Периметр прямокутника зі сторонами {a} та {b} дорівнює {p} од")
#
##