# 3. Список слів:

# Створіть список з 5-7 слів.
# Виведіть список на екран.
# Відсортуйте список за алфавітом.
# Виведіть відсортований список на екран.
# Перевірте, чи є у списку задане слово.

# sort() - метод, який сортує список за алфавітом
# reverse() - метод, який перевертає список

words = ["банан", "яблуко", "груша", "апельсин", "персик", "слива", "ківі"]
print(f"\n\nСписок слів: \n{words}")

words.sort()
# words.reverse()
print(f"\n\nВідсортований список слів: \n{words}")

search_word = input("\n\nВведіть слово для пошуку: ")

if search_word in words:
    print(f"\n\nСлово '{search_word}' є у списку.")
else:
    print(f"\n\nСлова '{search_word}' немає у списку.")