# 1. Список покупок:

# Створіть список покупок з 5-7 елементів.
# Виведіть список на екран.
# Додайте до списку ще 2 елементи.
# Видаліть один елемент зі списку.
# Виведіть оновлений список на екран.

# .append() - додає елемент в кінець списку
# .extend() - додає кілька елементів в кінець списку
# .remove() - видаляє перший знайдений елемент зі списку
# .pop() - видаляє елемент за індексом (за замовчуванням - останній)


shopping_list = ["молоко", "хліб", "яйця", "сир", "фрукти"]
print(f"\nПочатковий список покупок: \n{shopping_list}")

shopping_list.append("овочі")
shopping_list.append("м'ясо")

shopping_list.extend(["риба", "крупи"])

shopping_list.remove("яйця")

print(f"\nОновлений список покупок: \n{shopping_list}")