## 4. Список завдань: Додати завдання до списку

# 1. Користувач у консолі вводить назву завдання, яке потрібно додати до списку.
# 2. Програма додає завдання до списку.
# 3. Програма виводить на екран список завдань.



# enumrate() - функція, яка нумерує елементи списку та повертає їх разом з індексами.
# start=1 - параметр, який вказує, з якого числа починати нумерацію.

# with open() - функція, яка відкриває файл для запису.
# as file - створює змінну file, яка буде використовуватися для роботи з файлом.
# "todos-list.json" - назва файлу, у який буде записано список завдань.
# "w" - режим відкриття файлу, який дозволяє записувати дані у файл.

# json - модуль для роботи з JSON-форматом даних.
# json.dump() - функція, яка записує дані у файл у форматі JSON.


import json

print("\n\nСписок завдань")

todos = []

while True:
    print("\n\nНатисніть Enter, щоб вийти з програми")

    task = input("\n\nВведіть завдання: ")

    if task == "":
        exit()
    
    todos.append(task)

    print("\n\nСписок завдань:")

    for i, todo in enumerate(todos, start=1):
        print(f"{i}. {todo}")

    with open("todos-list.json", "w") as file:
        json.dump(todos, file)
