# Із пункту A в напрямку пункту B виїхав велосипедист, а че-
# рез 1 годину з пункту B назустріч йому виїхав мотоцикліст.
# Через x годин після виїзду мотоцикліста вони зустрілися.
# Знайдіть відстань між пунктами A і B, якщо велосипедист
# рухався зі швидкістю y км/год, а мотоцикліст — зі швид-
# кістю z км/год. Значення x, y та z вводить користувач.


# Введення даних
x = float(input("Введіть час у годинах: "))
y = float(input("Введіть швидкість велосипедиста: "))
z = float(input("Введіть швидкість мотоцикліста: "))

# Обчислення
time_cyclist = x + 1
distance_cyclist = time_cyclist * y
distance_motorcyclist = x * z
distance_total = distance_cyclist + distance_motorcyclist

# Виведення результату
print("Відстань між пунктами A і B: ", distance_total)

