# Є n білочок та m горіхів, які потрібно розділити порівну між
# білоч ками (значення n та m уводить користувач, m ≥ n).
# По скільки цілих горіхів отримає кожна білочка і скільки го-
# ріхів залишиться?


# Білочки та горішки
n = int(input("\nВведіть кількість білочок: "))
m = int(input("Введіть кількість горішків: "))

# Ділимо кількість горішків на кількість білочок
nuts_per_squirrel = m // n

# Знаходимо залишок горішків
remaining_nuts = m % n

# Виводимо результат
print(f"\nКожна білочка отримає по {nuts_per_squirrel} горіхів.")
print(f"Залишилось {remaining_nuts} горіхів.")