# Учні 7-А класу спілкувалися в соцмережі. Петрик зробив
# x дописів, Марічка — y дописів, а кожен із решти учнів —
# по z дописів. Скільки всього було зроблено дописів, якщо
# загалом у спілкуванні брали участь n учнів? Значення
# x, y, z та n вводить користувач.


# Дописи в соцмережах
n = int(input("\nВведіть загальну кількість учнів: "))
x = int(input("Скільки дописів зробив Петрик: "))
y = int(input("Скільки дописів зробила Марічка: "))
z = int(input("Скільки дописів зробив кожен із решти учнів: "))

# Знаходимо кількість решти учнів
other_students_count = n - 2

# Знаходимо загальну кількість дописів
total_posts = x + y + (other_students_count * z)

# Виводимо результат
print(f"\nЗагалом було зроблено {total_posts} дописів")