### Знаходження найменшого та найбільшого числа.

print("\nЗнаходження найменшого та найбільшого числа\n\n")


# Створюємо змінні для найменшого та найбільшого числа.

min = 9999999999999999999999999999999999999999999999999
max = -999999999999999999999999999999999999999999999999



# Створюємо цикл, в якому одразу порівнюємо введене число з найменшим та найбільшим числом записаних у змінних "min" та "max".

while True:
    number = input("Введіть число: ")

    if number == "" : break   # Якщо не вводити число та натиснути ENTER, то виходимо із циклу.

    number = float(number)   # Перетворюємо введене число із рядкового типу у дробовий.

    if number < min : min = number
    if number > max : max = number



# Виводимо у консоль найменше та найбільше число.

print(f"\n\nНайменше число: {min}")
print(f"Найбільше число: {max}\n\n")


input("*** Натисніть ENTER для виходу із програми ***\n\n")