### Знаходження найменшого та найбільшого значень.

print("\nЗнаходження найменшого та найбільшого значень серед 10 чисел\n\n")


# Створюємо набір значень.

# a = 5
# b = 2
# c = 10
# d = 20
# e = 8
# f = 15
# g = -4
# h = 12
# i = 25
# j = 7

a = float(input("Введіть число (1/10): "))
b = float(input("Введіть число (2/10): "))
c = float(input("Введіть число (3/10): "))
d = float(input("Введіть число (4/10): "))
e = float(input("Введіть число (5/10): "))
f = float(input("Введіть число (6/10): "))
g = float(input("Введіть число (7/10): "))
h = float(input("Введіть число (8/10): "))
i = float(input("Введіть число (9/10): "))
j = float(input("Введіть число (10/10): "))


# Створюємо змінні для найменшого та найбільшого значень.
# Припускаємо, що змінна "а" є найбільшим та найменшим значенням.

min = a
max = a


# Порівнюємо кожне значення з найменшим.
# Якщо поточне значення менше ніж найменше, то перезаписуємо значення змінної "min" цим значенням.

if b < min: min = b
if c < min: min = c
if d < min: min = d
if e < min: min = e
if f < min: min = f
if g < min: min = g
if h < min: min = h
if i < min: min = i
if j < min: min = j
    

# Порівнюємо кожне значення з найбільшим.
# Якщо поточне значення більше ніж найбільше, то перезаписуємо значення змінної "max" цим значенням.

if b > max: max = b
if c > max: max = c
if d > max: max = d
if e > max: max = e
if f > max: max = f
if g > max: max = g
if h > max: max = h
if i > max: max = i
if j > max: max = j
    

# Виводимо у консоль найменше та найбільше значення.
print(f"\n\n\nНайменше число: {min}")
print(f"Найбільше число: {max}\n\n")
