# tkinter - Бібліотека для створення графічного інтерфейсу
# Tk() - це клас, який представляє вікно програми
# title() - це метод, який встановлює заголовок вікна
# geometry() - це метод, який встановлює розміри вікна ("ширина x висота")
# configure() - це метод, який налаштовує параметри вікна
# bg - це параметр, який встановлює колір фону
# resizable() - це метод, який дозволяє або забороняє змінювати розміри вікна (x, y)
# mainloop() - це метод, який запускає цикл обробки подій

# Label - це клас, який представляє текстову мітку вікна
# root - це змінна, яка представляє основне вікно програми
# text - це параметр, який встановлює текст мітки
# font - це параметр, який встановлює шрифт тексту (назва, розмір, стиль)
# fg - це параметр, який встановлює колір тексту
# bg - це параметр, який встановлює колір фону
# pack() - це метод, який розміщує віджет у вікні
# padx - це параметр, який встановлює відступ зліва і справа віджета
# pady - це параметр, який встановлює відступ зверху і знизу віджета


from tkinter import Tk, Label

root = Tk()
root.title("Моя перша програма")
root.geometry("600x400")
root.configure(bg="lightblue")
root.resizable(False, False)

title_label = Label(root, text="Привіт, світ!", font=("Arial", 24, "bold"), fg="black", bg="lightblue")
title_label.pack(pady=20)

root.mainloop()