### Цикл FOR IN RANGE()

# Приклад 1. Якщо у range() передати лише один аргумент, то цикл виконається стільки разів, скільки вказали
# (в нашому прикладі - 5 разів). При цьому, початкове значення змінної і буде дорівнювати 0, а на кожній 
# ітерації буде збільшуватись на 1.

print("\n\n\n Приклад 1. \n\n for i in range(5) \n")

x = 0

for i in range(5):
    print(f"\n{i+1} ітерація:")
    print(f"x = {x}, i = {i}. Отже, x + i + 1 = {x + i + 1}")

    x += i + 1

print(f"\nКінцеве значення: x = {x}")



# Приклад 2. Якщо у range() передати два аргументи, то перший аргумент - це початкове значення змінної і, 
# а другий - кінцеве значення змінної і (але не включно!). Наприклад, якщо ми запишемо range(1, 6), то на першій
# ітерації змінна і = 1, а на останній і = 5. Тобто, якщо від другого аргумента відняти перший аргумент, то отримаємо 
# кількість ітерацій (кількість повторень циклу). В нашому прикладі 6 - 1 = 5 ітерацій.

print("\n\n\n Приклад 2. \n\n for i in range(1, 6) \n")

y = 0

for i in range(1, 6):
    print(f"\n{i} ітерація:")
    print(f"y = {y}, i = {i}. Отже, y + i = {y + i}")

    y += i

print(f"\nКінцеве значення: y = {y}")



# Приклад 3. Якщо у range() передати три аргументи, то перший аргумент - це початкове значення змінної і, 
# другий - кінцеве значення змінної і (але не включно!), а третій - це крок, з яким виконується цикл.
# В цьому випадку, для того, щоб обчислити кількість ітерацій потрібно від другого аргумента відняти перший, 
# а їх різницю поділити на третій аргумент. 

print("\n\n\n Приклад3. \n\n for i in range(5, 30, 5) \n")

z = 0

for i in range(5, 30, 5):
    print(f"\n{int(i/5)} ітерація:")
    print(f"z = {z}, i = {i}. Отже, z + i = {z + i}")

    z += i

print(f"\nКінцеве значення: z = {z}")